IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/am243x/GTC0_GTC_CFG0.xml
<module name="GTC0_GTC_CFG0" acronym="" XML_version="1.0" HW_revision="n/a" description="">
	<register id="GTC_CFG0_PID" acronym="GTC_CFG0_PID" offset="0x0" width="32" description="">
		<bitfield id="PID_MSB16" width="16" begin="31" end="16" resetval="0x24960" description="" range="31 - 16" rwaccess="R"/> 
		<bitfield id="PID_MISC" width="5" begin="15" end="11" resetval="0x0" description="" range="15 - 11" rwaccess="R"/> 
		<bitfield id="PID_MAJOR" width="3" begin="10" end="8" resetval="0x2" description="" range="10 - 8" rwaccess="R"/> 
		<bitfield id="PID_CUSTOM" width="2" begin="7" end="6" resetval="0x0" description="" range="7 - 6" rwaccess="R"/> 
		<bitfield id="PID_MINOR" width="6" begin="5" end="0" resetval="0x9" description="" range="5 - 0" rwaccess="R"/>
	</register>
	<register id="GTC_CFG0_GTC_PID" acronym="GTC_CFG0_GTC_PID" offset="0x4" width="32" description="">
		<bitfield id="GTC_PID_SCHEME" width="2" begin="31" end="30" resetval="0x1" description="PID follows new scheme" range="31 - 30" rwaccess="R"/> 
		<bitfield id="GTC_PID_BU" width="2" begin="29" end="28" resetval="0x2" description="Business unit - Processors" range="29 - 28" rwaccess="R"/> 
		<bitfield id="GTC_PID_FUNC" width="12" begin="27" end="16" resetval="0x1562" description="Module functional identifier - GTC module" range="27 - 16" rwaccess="R"/> 
		<bitfield id="GTC_PID_R_RTL" width="5" begin="15" end="11" resetval="0x0" description="RTL revision number - actual value determined by RTL" range="15 - 11" rwaccess="R"/> 
		<bitfield id="GTC_PID_X_MAJOR" width="3" begin="10" end="8" resetval="0x0" description="Major revision number - actual value determined by RTL" range="10 - 8" rwaccess="R"/> 
		<bitfield id="GTC_PID_CUSTOM" width="2" begin="7" end="6" resetval="0x0" description="Custom revision number - actual value determined by RTL" range="7 - 6" rwaccess="R"/> 
		<bitfield id="GTC_PID_Y_MINOR" width="6" begin="5" end="0" resetval="0x0" description="Minor revision number - actual value determined by RTL" range="5 - 0" rwaccess="R"/>
	</register>
	<register id="GTC_CFG0_PUSHEVT" acronym="GTC_CFG0_PUSHEVT" offset="0x8" width="32" description="">
		<bitfield id="PUSHEVT_EXPBIT_SEL" width="6" begin="5" end="0" resetval="0x0" description="Selects which bit [63:0] of the System Counter value is exported on the push_evt output. This field controls the 64:1 mux that drives the push_evt output." range="5 - 0" rwaccess="R/W"/>
	</register>
</module>